<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Categoricals-and-groupby" data-toc-modified-id="Categoricals-and-groupby-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Categoricals and groupby</a></span><ul class="toc-item"><li><span><a href="#Boolean-filter-and-count" data-toc-modified-id="Boolean-filter-and-count-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Boolean filter and count</a></span></li><li><span><a href="#Groupby-and-count" data-toc-modified-id="Groupby-and-count-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Groupby and count</a></span></li><li><span><a href="#Split-apply-combine" data-toc-modified-id="Split-apply-combine-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Split-apply-combine</a></span></li><li><span><a href="#Aggregation-/-Reduction" data-toc-modified-id="Aggregation-/-Reduction-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Aggregation / Reduction</a></span></li><li><span><a href="#Groupby-and-sum" data-toc-modified-id="Groupby-and-sum-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Groupby and sum</a></span></li><li><span><a href="#Groupby-and-mean:-multi-level-index" data-toc-modified-id="Groupby-and-mean:-multi-level-index-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Groupby and mean: multi-level index</a></span></li><li><span><a href="#Categorical-data" data-toc-modified-id="Categorical-data-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Categorical data</a></span></li><li><span><a href="#Grouping-by-multiple-columns" data-toc-modified-id="Grouping-by-multiple-columns-1.8"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>Grouping by multiple columns</a></span></li><li><span><a href="#Grouping-by-another-series" data-toc-modified-id="Grouping-by-another-series-1.9"><span class="toc-item-num">1.9&nbsp;&nbsp;</span>Grouping by another series</a></span></li></ul></li><li><span><a href="#Groupby-and-aggregation" data-toc-modified-id="Groupby-and-aggregation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Groupby and aggregation</a></span><ul class="toc-item"><li><span><a href="#Multiple-aggregations" data-toc-modified-id="Multiple-aggregations-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Multiple aggregations</a></span></li><li><span><a href="#Aggregation-functions" data-toc-modified-id="Aggregation-functions-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Aggregation functions</a></span></li><li><span><a href="#Custom-aggregation" data-toc-modified-id="Custom-aggregation-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Custom aggregation</a></span></li><li><span><a href="#Custom-aggregation:-dictionaries" data-toc-modified-id="Custom-aggregation:-dictionaries-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Custom aggregation: dictionaries</a></span></li><li><span><a href="#Computing-multiple-aggregates-of-multiple-columns" data-toc-modified-id="Computing-multiple-aggregates-of-multiple-columns-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Computing multiple aggregates of multiple columns</a></span></li></ul></li><li><span><a href="#Groupby-and-transformation" data-toc-modified-id="Groupby-and-transformation-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Groupby and transformation</a></span><ul class="toc-item"><li><span><a href="#The-z-score" data-toc-modified-id="The-z-score-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>The z-score</a></span></li><li><span><a href="#MPG-z-score" data-toc-modified-id="MPG-z-score-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>MPG z-score</a></span></li><li><span><a href="#MPG-z-score-by-year" data-toc-modified-id="MPG-z-score-by-year-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>MPG z-score by year</a></span></li><li><span><a href="#Apply-transformation-and-aggregation" data-toc-modified-id="Apply-transformation-and-aggregation-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Apply transformation and aggregation</a></span></li><li><span><a href="#Grouping-on-a-function-of-the-index" data-toc-modified-id="Grouping-on-a-function-of-the-index-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Grouping on a function of the index</a></span></li></ul></li><li><span><a href="#Groupby-and-filtering" data-toc-modified-id="Groupby-and-filtering-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Groupby and filtering</a></span><ul class="toc-item"><li><span><a href="#Mean-MPG-by-year" data-toc-modified-id="Mean-MPG-by-year-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Mean MPG by year</a></span></li><li><span><a href="#groupy-object" data-toc-modified-id="groupy-object-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>groupy object</a></span></li><li><span><a href="#Boolean-groupby" data-toc-modified-id="Boolean-groupby-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Boolean groupby</a></span></li></ul></li></ul></div>

# Categoricals and groupby

In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [3]:
sales = pd.DataFrame(
    {
        'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
        'city': ['Austin', 'Dallas', 'Austin', 'Dallas'], 
        'bread': [139, 237, 326, 456], 
        'butter': [20, 45, 70, 98]
    }
)

sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

## Boolean filter and count

In [4]:
sales.loc[sales['weekday'] == 'Sun'].count()

weekday    2
city       2
bread      2
butter     2
dtype: int64

## Groupby and count

In [5]:
sales.groupby('weekday').count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

## Split-apply-combine

- `sales.groupby('weekday').count()` 
	 - split by `'weekday'` apply `count()` function on each group 
	 - combine counts per group

## Aggregation / Reduction

 - Reduction functions 
	 - `mean()`
	 - `str()`
	 - `sum()`
	 - `first(), last()`
	 - `min(), max()`

## Groupby and sum

In [6]:
help(pd.DataFrame.groupby)

Help on function groupby in module pandas.core.generic:

groupby(self, by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, observed=False, **kwargs)
    Group DataFrame or Series using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, or list of labels
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If an ndarray is passed, the
        values are used as-is determine the groups. A label or list of
        labels may be passed to group by the columns in ``self``. Notice
        that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1).
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels.
    as_index : bool, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output.
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group.
    group_keys : bool, default True
        When calling apply, add group keys to index to identify pieces.
    squeeze : bool, default False
        Reduce the dimensionality of the return type if possible,
        otherwise return a consistent type.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionadded:: 0.23.0

    **kwargs
        Optional, only accepts keyword argument 'mutated' and is passed
        to groupby.

    Returns
    -------
    DataFrameGroupBy or SeriesGroupBy
        Depends on the calling object and returns groupby object that
        contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <http://pandas.pydata.org/pandas-docs/stable/groupby.html>`_ for more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level=1).mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

In [7]:
sales.groupby('weekday')['bread'].sum()

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

In [8]:
sales.groupby('weekday')['butter'].sum()

weekday
Mon    168
Sun     65
Name: butter, dtype: int64

In [9]:
sales.groupby('city')['bread'].mean()

city
Austin    232.5
Dallas    346.5
Name: bread, dtype: float64

In [10]:
sales.groupby('city')[['bread', 'butter']].sum()

        bread  butter
city
Austin    465      90
Dallas    693     143

## Groupby and mean: multi-level index

In [11]:
sales2 = sales.copy().set_index(['city', 'weekday']).sort_index()
sales2

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [12]:
sales.groupby(['city', 'weekday']).mean()

                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [13]:
customers = pd.Series(['Dave', 'Alice', 'Bob', 'Alice'])
customers

0     Dave
1    Alice
2      Bob
3    Alice
dtype: object

In [14]:
sales.groupby(customers)['bread'].sum()

Alice    693
Bob      326
Dave     139
Name: bread, dtype: int64

## Categorical data

In [15]:
help(pd.DataFrame.astype)

Help on function astype in module pandas.core.generic:

astype(self, dtype, copy=True, errors='raise', **kwargs)
    Cast a pandas object to a specified dtype ``dtype``.

    Parameters
    ----------
    dtype : data type, or dict of column name -> data type
        Use a numpy.dtype or Python type to cast entire pandas object to
        the same type. Alternatively, use {col: dtype, ...}, where col is a
        column label and dtype is a numpy.dtype or Python type to cast one
        or more of the DataFrame's columns to column-specific types.
    copy : bool, default True
        Return a copy when ``copy=True`` (be very careful setting
        ``copy=False`` as changes to values then may propagate to other
        pandas objects).
    errors : {'raise', 'ignore'}, default 'raise'
        Control raising of exceptions on invalid data for provided dtype.

        - ``raise`` : allow exceptions to be raised
        - ``ignore`` : suppress exceptions. On error return original object

        .. versionadded:: 0.20.0

    kwargs : keyword arguments to pass on to the constructor

    Returns
    -------
    casted : same type as caller

    See Also
    --------
    to_datetime : Convert argument to datetime.
    to_timedelta : Convert argument to timedelta.
    to_numeric : Convert argument to a numeric type.
    numpy.ndarray.astype : Cast a numpy array to a specified type.

    Examples
    --------
    Create a DataFrame:

    >>> d = {'col1': [1, 2], 'col2': [3, 4]}
    >>> df = pd.DataFrame(data=d)
    >>> df.dtypes
    col1    int64
    col2    int64
    dtype: object

    Cast all columns to int32:

    >>> df.astype('int32').dtypes
    col1    int32
    col2    int32
    dtype: object

    Cast col1 to int32 using a dictionary:

    >>> df.astype({'col1': 'int32'}).dtypes
    col1    int32
    col2    int64
    dtype: object

    Create a series:

    >>> ser = pd.Series([1, 2], dtype='int32')
    >>> ser
    0    1
    1    2
    dtype: int32
    >>> ser.astype('int64')
    0    1
    1    2
    dtype: int64

    Convert to categorical type:

    >>> ser.astype('category')
    0    1
    1    2
    dtype: category
    Categories (2, int64): [1, 2]

    Convert to ordered categorical type with custom ordering:

    >>> cat_dtype = pd.api.types.CategoricalDtype(
    ...                     categories=[2, 1], ordered=True)
    >>> ser.astype(cat_dtype)
    0    1
    1    2
    dtype: category
    Categories (2, int64): [2 < 1]

    Note that using ``copy=False`` and changing data on a new
    pandas object may propagate changes:

    >>> s1 = pd.Series([1,2])
    >>> s2 = s1.astype('int64', copy=False)
    >>> s2[0] = 10
    >>> s1  # note that s1[0] has changed too
    0    10
    1     2
    dtype: int64

In [16]:
sales['weekday'].unique()

array(['Sun', 'Mon'], dtype=object)

In [17]:
sales['weekday'].astype('category')

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): [Mon, Sun]

 **Advantages**  
 - Uses less memory  
 - Speeds up operations like `groupby()`

## Grouping by multiple columns

The `'pclass'` column identifies which class of ticket was purchased by the passenger and the `'embarked'` column indicates at which of the three ports the passenger boarded the Titanic. `'S'` stands for Southampton, England, `'C'` for Cherbourg, France and `'Q'` for Queenstown, Ireland.

In [18]:
titanic = pd.read_csv('titanic.csv')
titanic.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [19]:
count_by_class = titanic.groupby('pclass').count() 
count_by_class

,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
pclass,,,,,,,,,,,,,
1,323,323,323,284,323,323,323,323,256,321,201,35,289
2,277,277,277,261,277,277,277,277,23,277,112,31,261
3,709,709,709,501,709,709,709,708,16,709,173,55,195

In [20]:
count_by_class['survived']

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [21]:
by_mult = titanic.groupby(['embarked', 'pclass']).count()
by_mult

                 survived  name  sex  age  sibsp  parch  ticket  fare  cabin  \
embarked pclass
C        1            141   141  141  128    141    141     141   141    111
         2             28    28   28   24     28     28      28    28      4
         3            101   101  101   60    101    101     101   101      3
Q        1              3     3    3    3      3      3       3     3      3
         2              7     7    7    5      7      7       7     7      1
         3            113   113  113   42    113    113     113   113      1
S        1            177   177  177  151    177    177     177   177    140
         2            242   242  242  232    242    242     242   242     18
         3            495   495  495  399    495    495     495   494     12

                 boat  body  home.dest
embarked pclass
C        1         98    14        121
         2         15     2         27
         3         36     9         24
Q        1          2     1          3
         2          2     0          4
         3         34     6         30
S        1         99    20        164
         2         95    29        230
         3        103    40        141

In [22]:
by_mult['survived']

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

## Grouping by another series

In [23]:
life = pd.read_csv('life_expectancy_at_birth.csv', index_col='Life expectancy')
del life['Unnamed: 0']
life.head()

,1800,1801,1802,1803,1804,1805,1806,1807,1808,1809,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
Life expectancy,,,,,,,,,,,,,,,,,,,,,
Abkhazia,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Afghanistan,28.21,28.20,28.19,28.18,28.17,28.16,28.15,28.14,28.13,28.12,...,52.4,52.8,53.3,53.6,54.0,54.4,54.8,54.9,53.8,52.72
Akrotiri and Dhekelia,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Albania,35.40,35.40,35.40,35.40,35.40,35.40,35.40,35.40,35.40,35.40,...,76.6,76.8,77.0,77.2,77.4,77.5,77.7,77.9,78.0,78.10
Algeria,28.82,28.82,28.82,28.82,28.82,28.82,28.82,28.82,28.82,28.82,...,75.3,75.5,75.7,76.0,76.1,76.2,76.3,76.3,76.4,76.50

In [24]:
regions.shape

NameError: name 'regions' is not defined

In [ ]:
regions = pd.read_csv('world_regions.csv')
del regions['Country']
regions.columns = ['Country', 'region']
regions = regions.set_index('Country')
regions.info()

In [ ]:
life_by_region = life.groupby(regions['region'])
life_by_region

In [ ]:
life_by_region['1964'].mean()

In [ ]:
life_by_region['1970'].mean()

In [ ]:
life_by_region['2010'].mean()

# Groupby and aggregation

In [25]:
sales.groupby('city')[['bread', 'butter']].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

## Multiple aggregations

In [26]:
sales.groupby('city')[['bread', 'butter']].agg(['max', 'sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

In [27]:
sales.groupby('city')[['bread', 'butter']].agg(['max','mean', 'min', 'std'])

       bread                         butter
         max   mean  min         std    max  mean min        std
city
Austin   326  232.5  139  132.228968     70  45.0  20  35.355339
Dallas   456  346.5  237  154.856385     98  71.5  45  37.476659

## Aggregation functions

 - string names   
 - `sum`   
 - `mean`  
 - `count`

## Custom aggregation

In [28]:
def data_range(series):
    return series.max() - series.min()

In [29]:
sales.groupby('weekday')[['bread', 'butter']].agg(data_range)

         bread  butter
weekday
Mon        130      28
Sun         98      25

## Custom aggregation: dictionaries

In [30]:
sales.groupby(customers)[['bread', 'butter']].agg({'bread':'sum', 'butter':data_range})

       bread  butter
Alice    693      53
Bob      326       0
Dave     139       0

## Computing multiple aggregates of multiple columns

In [31]:
aggregated = titanic.groupby('pclass')[['age', 'fare']].agg(['max', 'median'])
aggregated

         age             fare
         max median       max   median
pclass
1       80.0   39.0  512.3292  60.0000
2       70.0   29.0   73.5000  15.0458
3       74.0   24.0   69.5500   8.0500

In [32]:
aggregated.loc[:, ('age', 'max')]

pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64

In [33]:
aggregated.loc[:, ('fare', 'median')]

pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64

# Groupby and transformation

## The z-score

In [34]:
def zscore(series):
    return (series - series.mean()) / series.std()

In [35]:
auto = pd.read_csv('auto-mpg.csv')
auto.head()

    mpg  cyl  displ   hp  weight  accel  yr origin                       name
0  18.0    8  307.0  130    3504   12.0  70     US  chevrolet chevelle malibu
1  15.0    8  350.0  165    3693   11.5  70     US          buick skylark 320
2  18.0    8  318.0  150    3436   11.0  70     US         plymouth satellite
3  16.0    8  304.0  150    3433   12.0  70     US              amc rebel sst
4  17.0    8  302.0  140    3449   10.5  70     US                ford torino

## MPG z-score

The **z-score** of a value is its distance from the mean of its population measured in units of standard deviation.

In [36]:
zscore(auto['mpg']).head()

0   -0.697747
1   -1.082115
2   -0.697747
3   -0.953992
4   -0.825870
Name: mpg, dtype: float64

## MPG z-score by year

In [37]:
help(pd.DataFrame.transform)

Help on function transform in module pandas.core.frame:

transform(self, func, axis=0, *args, **kwargs)
    Call ``func`` on self producing a DataFrame with transformed values
    and that has the same axis length as self.

    .. versionadded:: 0.20.0

    Parameters
    ----------
    func : function, str, list or dict
        Function to use for transforming the data. If a function, must either
        work when passed a DataFrame or when passed to DataFrame.apply.

        Accepted combinations are:

        - function
        - string function name
        - list of functions and/or function names, e.g. ``[np.exp. 'sqrt']``
        - dict of axis labels -> functions, function names or list of such.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        If 0 or 'index': apply function to each column.
        If 1 or 'columns': apply function to each row.
    *args
        Positional arguments to pass to `func`.
    **kwargs
        Keyword arguments to pass to `func`.

    Returns
    -------
    DataFrame
        A DataFrame that must have the same length as self.

    Raises
    ------
    ValueError : If the returned DataFrame has a different length than self.

    See Also
    --------
    DataFrame.agg : Only perform aggregating type operations.
    DataFrame.apply : Invoke function on a DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame({'A': range(3), 'B': range(1, 4)})
    >>> df
       A  B
    0  0  1
    1  1  2
    2  2  3
    >>> df.transform(lambda x: x + 1)
       A  B
    0  1  2
    1  2  3
    2  3  4

    Even though the resulting DataFrame must have the same length as the
    input DataFrame, it is possible to provide several input functions:

    >>> s = pd.Series(range(3))
    >>> s
    0    0
    1    1
    2    2
    dtype: int64
    >>> s.transform([np.sqrt, np.exp])
           sqrt        exp
    0  0.000000   1.000000
    1  1.000000   2.718282
    2  1.414214   7.389056

In [38]:
auto.groupby('yr')['mpg'].transform(zscore).head()

0    0.058125
1   -0.503753
2    0.058125
3   -0.316460
4   -0.129168
Name: mpg, dtype: float64

## Apply transformation and aggregation

In [39]:
help(pd.DataFrame.apply)

Help on function apply in module pandas.core.frame:

apply(self, func, axis=0, broadcast=None, raw=False, reduce=None, result_type=None, args=(), **kwds)
    Apply a function along an axis of the DataFrame.

    Objects passed to the function are Series objects whose index is
    either the DataFrame's index (``axis=0``) or the DataFrame's columns
    (``axis=1``). By default (``result_type=None``), the final return type
    is inferred from the return type of the applied function. Otherwise,
    it depends on the `result_type` argument.

    Parameters
    ----------
    func : function
        Function to apply to each column or row.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis along which the function is applied:

        * 0 or 'index': apply function to each column.
        * 1 or 'columns': apply function to each row.
    broadcast : bool, optional
        Only relevant for aggregation functions:

        * ``False`` or ``None`` : returns a Series whose length is the
          length of the index or the number of columns (based on the
          `axis` parameter)
        * ``True`` : results will be broadcast to the original shape
          of the frame, the original index and columns will be retained.

        .. deprecated:: 0.23.0
           This argument will be removed in a future version, replaced
           by result_type='broadcast'.

    raw : bool, default False
        * ``False`` : passes each row or column as a Series to the
          function.
        * ``True`` : the passed function will receive ndarray objects
          instead.
          If you are just applying a NumPy reduction function this will
          achieve much better performance.
    reduce : bool or None, default None
        Try to apply reduction procedures. If the DataFrame is empty,
        `apply` will use `reduce` to determine whether the result
        should be a Series or a DataFrame. If ``reduce=None`` (the
        default), `apply`'s return value will be guessed by calling
        `func` on an empty Series
        (note: while guessing, exceptions raised by `func` will be
        ignored).
        If ``reduce=True`` a Series will always be returned, and if
        ``reduce=False`` a DataFrame will always be returned.

        .. deprecated:: 0.23.0
           This argument will be removed in a future version, replaced
           by ``result_type='reduce'``.

    result_type : {'expand', 'reduce', 'broadcast', None}, default None
        These only act when ``axis=1`` (columns):

        * 'expand' : list-like results will be turned into columns.
        * 'reduce' : returns a Series if possible rather than expanding
          list-like results. This is the opposite of 'expand'.
        * 'broadcast' : results will be broadcast to the original shape
          of the DataFrame, the original index and columns will be
          retained.

        The default behaviour (None) depends on the return value of the
        applied function: list-like results will be returned as a Series
        of those. However if the apply function returns a Series these
        are expanded to columns.

        .. versionadded:: 0.23.0

    args : tuple
        Positional arguments to pass to `func` in addition to the
        array/series.
    **kwds
        Additional keyword arguments to pass as keywords arguments to
        `func`.

    Returns
    -------
    Series or DataFrame
        Result of applying ``func`` along the given axis of the
        DataFrame.

    See Also
    --------
    DataFrame.applymap: For elementwise operations.
    DataFrame.aggregate: Only perform aggregating type operations.
    DataFrame.transform: Only perform transforming type operations.

    Notes
    -----
    In the current implementation apply calls `func` twice on the
    first column/row to decide whether it can take a fast or slow
    code path. This can lead to unexpected behavior if `func` has
    side-effects, as they will take effect twice for the first
    column/row.

    Examples
    --------

    >>> df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
    >>> df
       A  B
    0  4  9
    1  4  9
    2  4  9

    Using a numpy universal function (in this case the same as
    ``np.sqrt(df)``):

    >>> df.apply(np.sqrt)
         A    B
    0  2.0  3.0
    1  2.0  3.0
    2  2.0  3.0

    Using a reducing function on either axis

    >>> df.apply(np.sum, axis=0)
    A    12
    B    27
    dtype: int64

    >>> df.apply(np.sum, axis=1)
    0    13
    1    13
    2    13
    dtype: int64

    Returning a list-like will result in a Series

    >>> df.apply(lambda x: [1, 2], axis=1)
    0    [1, 2]
    1    [1, 2]
    2    [1, 2]
    dtype: object

    Passing result_type='expand' will expand list-like results
    to columns of a Dataframe

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='expand')
       0  1
    0  1  2
    1  1  2
    2  1  2

    Returning a Series inside the function is similar to passing
    ``result_type='expand'``. The resulting column names
    will be the Series index.

    >>> df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)
       foo  bar
    0    1    2
    1    1    2
    2    1    2

    Passing ``result_type='broadcast'`` will ensure the same shape
    result, whether list-like or scalar is returned by the function,
    and broadcast it along the axis. The resulting column names will
    be the originals.

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')
       A  B
    0  1  2
    1  1  2
    2  1  2

In [40]:
# the dictionary values are selections from the input group

def zscore_with_year_and_name(group):
    df = pd.DataFrame(
                {'mpg': zscore(group['mpg']),
                 'year': group['yr'],
                 'name': group['name']
                })
    return df

In [41]:
auto.groupby('yr').apply(zscore_with_year_and_name).head()

        mpg  year                       name
0  0.058125    70  chevrolet chevelle malibu
1 -0.503753    70          buick skylark 320
2  0.058125    70         plymouth satellite
3 -0.316460    70              amc rebel sst
4 -0.129168    70                ford torino

In [42]:
len(auto.columns)

9

In [43]:
auto.columns

Index(['mpg', 'cyl', 'displ', 'hp', 'weight', 'accel', 'yr', 'origin', 'name'], dtype='object')

In [44]:
gapminder = pd.read_csv('gapminder_tidy.csv', index_col=['Year', 'region', 'Country']).sort_index()
gapminder.head()

                                  fertility    life  population  \
Year region  Country
1964 America Antigua and Barbuda      4.250  63.775     58653.0
             Argentina                3.068  65.388  21966478.0
             Aruba                    4.059  67.113     57031.0
             Bahamas                  4.220  64.189    133709.0
             Barbados                 4.094  62.819    234455.0

                                  child_mortality      gdp
Year region  Country
1964 America Antigua and Barbuda            72.78   5008.0
             Argentina                      57.43   8227.0
             Aruba                            NaN   5505.0
             Bahamas                        48.56  18160.0
             Barbados                       64.70   5681.0

In [45]:
by_year_region = gapminder.groupby(level=['Year', 'region'])
by_year_region.head(1)

                                                     fertility    life  \
Year region                     Country
1964 America                    Antigua and Barbuda      4.250  63.775
     East Asia & Pacific        Australia                3.154  70.650
     Europe & Central Asia      Albania                  5.711  65.475
     Middle East & North Africa Algeria                  7.653  47.953
     South Asia                 Afghanistan              7.671  33.639
...                                                        ...     ...
2013 East Asia & Pacific        Australia                1.882  82.496
     Europe & Central Asia      Albania                  1.771  77.392
     Middle East & North Africa Algeria                  2.795  71.000
     South Asia                 Afghanistan              4.900  60.947
     Sub-Saharan Africa         Angola                   5.863  51.899

                                                     population  \
Year region                     Country
1964 America                    Antigua and Barbuda     58653.0
     East Asia & Pacific        Australia            11122567.0
     Europe & Central Asia      Albania               1817098.0
     Middle East & North Africa Algeria              11654905.0
     South Asia                 Afghanistan          10474903.0
...                                                         ...
2013 East Asia & Pacific        Australia            23213944.0
     Europe & Central Asia      Albania               3238316.0
     Middle East & North Africa Algeria              36983924.0
     South Asia                 Afghanistan          34499915.0
     Sub-Saharan Africa         Angola               20714494.0

                                                     child_mortality      gdp
Year region                     Country
1964 America                    Antigua and Barbuda            72.78   5008.0
     East Asia & Pacific        Australia                      22.70  16098.0
     Europe & Central Asia      Albania                       122.67   3023.0
     Middle East & North Africa Algeria                       247.30   5693.0
     South Asia                 Afghanistan                   339.70   1182.0
...                                                              ...      ...
2013 East Asia & Pacific        Australia                       4.00  42840.0
     Europe & Central Asia      Albania                        14.90   9961.0
     Middle East & North Africa Algeria                        25.20  12893.0
     South Asia                 Afghanistan                    96.70   1884.0
     Sub-Saharan Africa         Angola                        167.10   7488.0

[300 rows x 5 columns]

In [46]:
def spread(series):
    return series.max() - series.min()

In [47]:
aggregator = {'population':'sum', 'child_mortality':'mean', 'gdp':spread}

In [48]:
aggregated = by_year_region.agg(aggregator)
aggregated.tail(6)

                                   population  child_mortality       gdp
Year region
2013 America                     9.629087e+08        17.745833   49634.0
     East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

## Grouping on a function of the index

In [49]:
soft = pd.read_csv('sales-feb-2015.csv', index_col='Date', parse_dates=True)
soft.head()

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14

In [50]:
by_day = soft.groupby(soft.index.strftime('%a'))
by_day.head(1)

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-07 23:00:00  Acme Coporation  Hardware      1

In [51]:
type(by_day)

pandas.core.groupby.generic.DataFrameGroupBy

In [63]:
by_day

In [52]:
units_sum = by_day['Units'].sum()
units_sum

Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

# Groupby and filtering

## Mean MPG by year

In [53]:
auto.groupby('yr')['mpg'].mean()

yr
70    17.689655
71    21.111111
72    18.714286
73    17.100000
74    22.769231
75    20.266667
76    21.573529
77    23.375000
78    24.061111
79    25.093103
80    33.803704
81    30.185714
82    32.000000
Name: mpg, dtype: float64

## groupy object

In [54]:
splitting = auto.groupby('yr')
splitting

In [55]:
type(splitting)

pandas.core.groupby.generic.DataFrameGroupBy

In [56]:
type(splitting.groups)

dict

In [57]:
splitting.groups.keys()

dict_keys([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [58]:
splitting.groups

{70: Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
             17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
            dtype='int64'),
 71: Int64Index([29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45,
             46, 47, 48, 49, 50, 51, 52, 53, 54, 55],
            dtype='int64'),
 72: Int64Index([56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72,
             73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83],
            dtype='int64'),
 73: Int64Index([ 84,  85,  86,  87,  88,  89,  90,  91,  92,  93,  94,  95,  96,
              97,  98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109,
             110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122,
             123],
            dtype='int64'),
 74: Int64Index([124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136,
             137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
            dtype='int64'),
 75: Int64Index([150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162,
             163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175,
             176, 177, 178, 179],
            dtype='int64'),
 76: Int64Index([180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192,
             193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205,
             206, 207, 208, 209, 210, 211, 212, 213],
            dtype='int64'),
 77: Int64Index([214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226,
             227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239,
             240, 241],
            dtype='int64'),
 78: Int64Index([242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254,
             255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267,
             268, 269, 270, 271, 272, 273, 274, 275, 276, 277],
            dtype='int64'),
 79: Int64Index([278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290,
             291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303,
             304, 305, 306],
            dtype='int64'),
 80: Int64Index([307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319,
             320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332,
             333],
            dtype='int64'),
 81: Int64Index([334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346,
             347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359,
             360, 361],
            dtype='int64'),
 82: Int64Index([362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374,
             375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387,
             388, 389, 390, 391],
            dtype='int64')}

In [59]:
for group_name, group in splitting:
    avg = group['mpg'].mean()
    print(group_name, avg)

70 17.689655172413794
71 21.11111111111111
72 18.714285714285715
73 17.1
74 22.76923076923077
75 20.266666666666666
76 21.573529411764707
77 23.375
78 24.061111111111114
79 25.09310344827585
80 33.803703703703704
81 30.185714285714287
82 32.0

In [60]:
for group_name, group in splitting:
    avg = group.loc[group['name'].str.contains('chevrolet'), 'mpg'].mean() 
    print(group_name, avg)

70 15.666666666666666
71 20.25
72 15.333333333333334
73 14.833333333333334
74 18.666666666666668
75 17.666666666666668
76 23.25
77 20.25
78 23.233333333333334
79 21.666666666666668
80 30.05
81 23.5
82 29.0

In [61]:
chevy_means = {year:group.loc[group['name'].str.contains('chevrolet'), 'mpg'].mean() for year, group in splitting}
pd.Series(chevy_means)

70    15.666667
71    20.250000
72    15.333333
73    14.833333
74    18.666667
75    17.666667
76    23.250000
77    20.250000
78    23.233333
79    21.666667
80    30.050000
81    23.500000
82    29.000000
dtype: float64

## Boolean groupby

In [62]:
chevy = auto['name'].str.contains('chevrolet') 
auto.groupby(['yr', chevy])['mpg'].mean()

yr  name
70  False    17.923077
    True     15.666667
71  False    21.260870
    True     20.250000
72  False    19.120000
    True     15.333333
73  False    17.500000
    True     14.833333
74  False    23.304348
    True     18.666667
75  False    20.555556
    True     17.666667
76  False    21.350000
    True     23.250000
77  False    23.895833
    True     20.250000
78  False    24.136364
    True     23.233333
79  False    25.488462
    True     21.666667
80  False    34.104000
    True     30.050000
81  False    30.433333
    True     23.500000
82  False    32.461538
    True     29.000000
Name: mpg, dtype: float64